---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinition.GetDefaultResolutionType
source: html/689bd861-133a-2038-de65-fec25df6c8fb.htm
---
# Autodesk.Revit.DB.FailureDefinition.GetDefaultResolutionType Method

Retrieves the default resolution type for the failure.

## Syntax (C#)
```csharp
public FailureResolutionType GetDefaultResolutionType()
```

## Returns
The Default resolution type for the failure.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - FailureDefinition does not have any resolutions.